'''a = int(input("num  "))
b  = int(input("num "))
c  = int(input("num "))
if a<=b<=c or c<=b<=a:
    print(b)
elif c<=a<=b or b<=a<=c:
    print(a) 
elif a<=c<=b or b<=c<=a:
    print(c)  '''     
    # Напишите программу, которая на входе будет получать число, а на выходе выводить
    # на экран «Четное число» или «Нечетное число» в зависимости от четности полученного числа.

'''l = int(input("write number"))
if l%2==0:
    print("that is  jup san")
else:
    print("tak san")'''    
     # Напишите программу, которая на входе будет получать число, а на выходе выводить
    # на экран «Положительное число» или «Отрицательное число» в зависимости от полученного числа.
'''n = int(input("write number"))
if n>0:

    print("that is on san")
else:
    print("tat is ters san")'''    
#     a = 35
    # b = 25
    # c = 75
    # С помощью условного оператора найдите максимальное и минимальное значение из значений переме
'''q= input(input())
w= input(input())
e= input(input())
max = 0
min = 0
 #max
if q>w and q>e:
   max = q
if w>q and w>e:
   max = w
if e>q and e>w:
   max =e 
 #min
 
if q<w and q<e:
   min = q
if w<q and w<e:
   min = w
if e<q and e<w:
   min = e
    #
    # 

print('MIN:',min)
print('MAX:',min)


Пользователь вводит логин и если логин "admin", то должно выйти сообщение "Добро пожаловать, программист!”, 
    # если же логин "manager", то другая надпись - "Сайт приветствует руководство!". 
    # В другом варианте должно выйти ещё одно сообщение "Программа завершила своё исполнение..."

    # Пример:
    # Ввод: 
    # admin
    # Вывод:
    # Добро пожаловать, программист!
    # Программа завершила своё исполнение...
    

