# dictionary = {'vk':'vk.com',
#               'google':'google.com',
#               'facebook':'facebook.com'      
# },
# del dictionary ['google']
# for key,values in dictionary.items():
#     print(key)
# dictionary.clear()
# for key,values in dictionary.items():
#     print(key)
# del dictionary
# for key,vlues in dictionary.items():
#     print(key)     

#Задание 4:
    # Вам даны несколько последовательностей чисел:
    # sequence_0 = [14,10,35,45,'60',70,90,0,105,150,10.0,45.0,'70',0]
    # sequence_1 = [14,10,35,45,'60',70,90,0,105,150,'70']
    # sequence_2 = [14,10,35,45,'60',70,90,0,105,150,10.0,45.0,'70',0.0]
    # sequence_3 = [14,10,35,45,'60',70,90,0,105,150,10.0,45.0,'70']
    # Нужно проверить, все ли числа в КАЖДОЙ последовательности уникальны.
    # Если в последовательности были найдены дубликаты ---> Выведите на экран: "Последовательность не уникальна."
    # Если в последовательности дубликатов найдено не было ---> Выведите на экран: "Последовательность уникальна."
    # Если в решении задания не присутствует цикл ---> Задание не защитано.



#if you  will buy on one month 500$  or at one day you will shopp 200$ thing then for you suppermarket will give you present
# gender = int(input('are you female?(yes=1,no=0 : '))
# day = int(input("how many $$$ did you spent today:  "))
# month = int(input("how many $$$ did you spent one month:  "))

# if  gender == 1 and day > 200 or month >= 500:
#     print("HEY ! you got present")
# elif:
#     print("you didnt do 500$ shop") 
#     print("plase! try next month")   



# sequence_0 = [14,10,35,45,'60',70,90,0,105,150,10.0,45.0,'70',0]
# sequence_1 = [14,10,35,45,'60',70,90,0,105,150,'70']
# sequence_2 = [14,10,35,45,'60',70,90,0,105,150,10.0,45.0,'70',0.0]
# sequence_3 = [14,10,35,45,'60',70,90,0,105,150,10.0,45.0,'70']
# l = set(sequence_0)
# print(l)
# h = set(sequence_1)
# print(h)
# m = set(sequence_2)
# print(m)
# k = set(sequence_3)
# print(k)








# for t in range(11):
#     print(9,'*',t,'=',t*9) 

# for b in range(11):
#     print(2,'*',b,'=',b*2)







# for t in range(11):
#     print(7,'*',t,7*t)

# g = int(input('write big number'))
# k = int(input('write quite big number'))
# l = int(input('write minus number'))
# if g > k or g > l :
#     print('first number  big')
# elif k > g or k > l:
#     print('second number  big')   
# elif l > k or l > g:
#     print('minus number big')    
# elif k == g and k == l or l == g:
#     print('they are equally')   
# else:
#     print('I DONT UNDERSTAND')      






# Создайте цикл который
# справшивает у
''
# пользователя 10 чисел и
# добавьте их в SET.
# Сделайте так чтобы эти
# данные уже никто не смог

# поменять позже.


empty = set(e(10):
    number = )
    empty.add(number)
print(empty)for i in rangint(input("Vvedite chislo(: "))





