 #q = int(3)
 # #w = int(4)
 #if q>w:
  #  print(q)
 #if w>q:
   # print(w) 
   #    
   #Problem1:
    # Среди трех чисел найти среднее
    
    # Примеbр:
    # Введите три числа: 3 5 4
    # Отве
# '''a = int(input())
# e = int(input())
# r = int(input())

# if a < e and e < r:
#     print(e)
# elif e < a and a < r:
#     print(a)
# else:
#     print(r)    ''''            
    #Problem6:
    # Напишите программу, которая принимает число.
    #   Если число делится на 3, оно должно вывести «Fizz».
    #   Если он делится на 5, он должен вывести «Buzz».
    #   Если он делится как на 3, так и на 5, он должен вывести «FizzBuzz».
    #   В противном случае он должен вывести то же число.
#size = int(input("your size"))
#if size < 40:
  #  print('we have your size')
#elif size>40 and size<47:
 #   print('we have your size')
#else:  
  #  print('we dont have your size')  

#auto = int(input( 'choose auto'))
#if  auto == 1:
  #  print('BMW')
#elif auto == 2:
 #   print('lada')
#elif auto == 3:
  #  print('mersedes')
#elif auto == 4:
  #  print("ROW")    
#else:
 #   print("we dont have all autos")    

#color = (input('translate to kyrgyz'))
#if color == 'red':
  #  print('kyzyl')
#elif color == 'black':
 #   print('kapa')
#elif color == 'blue':
   # print('kok')
#elif color == 'green':
#    print('jashyl')
#else:
  #  print('i dont know any color')               

#num = int(input('translate num to kyrgyz'))
#if num == 1:
  #  print('bir')
#elif num == 2:
 #   print('eki')
#elif num == 3:
 #   print('ych')
#elif num == 4:
 #   print('tort') 
#else:
 #   print(' i cant translate') 


#Problem2:
    # Напишите программу, которая на входе будет получать число, а на выходе выводить
    # на экран «Четное число» или «Нечетное число» в зависимости от четности полученного числа.

    # Пример:
    # Введите число: 10
    # Четное число
    # Введите число: 11
    # Нечетное число
#num = int(input('write number'))
#if  num % 2 ==0:
 #   print('jup san') 
#else:
  #  print('tak san')  
  # 
  #          
#Problem4:
    # Пользователь вводит логин и если логин "admin", то должно выйти сообщение "Добро пожаловать, программист!”, 
    # если же логин "manager", то другая надпись - "Сайт приветствует руководство!". 
    # В другом варианте должно выйти ещё одно сообщение "Программа завершила своё исполнение..."

    # Пример:
    # Ввод: 
    # admin
    # Вывод:
    # Добро пожаловать, программист!
    # Программа завершила своё исполнение...
#LOG = input('message')
#if LOG == 'admin': 
    # print('welcom')
#elif LOG =='manager':
#    print('sait privetstvuet rukovotstvo!')
#else:
  #  print('programm completed') 
     

    #Problem5:
    # a = 35
    # b = 25
    # c = 75
    # С помощью условного оператора найдите максимальное и минимальное значение из значений переменных
#a = (input('max'))
#b = (input('max'))
#c = (input('max'))
#if a>b and a>c:
#    print('max', a)
#elif b>c and b>a:
 #   print('max',b)
#elif c>b and c>a:
  #  print('max',c) 
  # 
  #    
  #  Problem6:
    # Напишите программу, которая принимает число.
    #   Если число делится на 3, оно должно вывести «Fizz».
    #   Если он делится на 5, он должен вывести «Buzz».
    #   Если он делится как на 3, так и на 5, он должен вывести «FizzBuzz».
    #   В противном случае он должен вывести то же число.
#num = int(input('write num'))
#if num % 3 == 0:
   # print('fizz')
#elif num % 5 == 0:
   # print('buzz')
#else:
 #   print('fizzbuzz')   



    #Problem7:

    # Возьмите у пользователя значения длины и ширины прямоугольника и проверьте, квадратный он или нет.
#prm = int (input())  
#tjk = int(input())
#if prm == tjk: 
  #  print('tik burch')
#elif prm != tjk:
  #  print('kvadrat')
#else:
  #  print('uch burch')    




  # Problem8:
    # Возьмите два значения int от пользователя и выведите наибольшее из них.
l = int(input('that is big'))
p = int(input('that is little'))  
if l>p ==0:
    print('true',l) 
elif p>l ==0:
    print('false',p)
else:
    print('all are false')    





     Problem9:
    # a = 123
    # b = 321
    #  если сумма a и b четное -> вывести на экран половину суммы a и b
    #  если половина суммы меньше b и больше a -> вывести на экран "b > sum/2 > a"

           