
# Задача 1:
  # Спросите у пользователя название любого файла с любым расширением.
  # Попробуйте определить с какое расширение у файла.
  
  # Пример:
    # Ввод: image.png
    # Вывод: png
# j = input('write word')
# a = j.index('.')
# print(j[a+1 :])





    # Ввод: music.mp3
    # Вывод: mp3

    # Ввод: file
    # Вывод: Расширение не найдено

# Задача 2:
  # Спросите у пользователя число N и верните ему число которое получилось по следующей формуле: N + N*N + N*N*N

  # Пример:
  # N = 5
  # Result: 615
# n = int(input('number: ')
# result = n + n * n + n * n * n
# print(result) 



# Задача 3.
# word = ''
# symbol = ''
# Спросите у пользователя любое слово и запишите в word
# Потом еще раз спросите любой символ из кириллицы и запишите его в symbol
# Вычислите сколько раз встречается symbol в слове word
# Решите задачу с помощью цикла
    # Например:
    # Ввод:  word = 'Государтсво'
    # Ввод:  symbol = 'о'
    
 
 
# Задача 4.
# Задан список строк. В каждой строке подсчитать количество вхождений заданного символа
# Решите задачу с помощью цикла while
# Количество вхождений символа в списке строк
# listWords=['google', 'apple', 'microsoft', 'windows', 'mac', 'facebook', 'instagram', 'tiktok']
# c='o' # символ 'o'
# sym_count=[] # количество вхождений символа
# Результатом должен быть список: [2, 0, 2, 1, 0, 2, 0, 1]

listWord =['google', 'apple', 'microsoft', 'windows', 'mac', 'facebook', 'instagram', 'tiktok']
c = input('symbol: ')

sym_count = []
for word in listWord:
    sym_count.append(word.count(c))
print(sym_count)





# Задача 5.
# products = {
#    'утюг': 3500,
#    'телевизов': 24000,
#    'стиральная_машина': 30000,
#    'фен': 5500
# }
# Дан список продуктов products.
# Как раз в магазине проходит скидка в размере 15% на весь товар
# Вычислите сколько денег нужно чтобы купить весь товар ?


products = {
#    'утюг': 3500,
    'телевизов': 24000,
    'стиральная_машина': 30000,
    'фен': 5500
 }
