# sequence_0 = [14,10,35,45,'60',70,90,0,105,150,10.0,45.0,'70',0]
# sequence_1 = [14,10,35,45,'60',70,90,0,105,150,'70']
# sequence_2 = [14,10,35,45,'60',70,90,0,105,150,10.0,45.0,'70',0.0]
# sequence_3 = [14,10,35,45,'60',70,90,0,105,150,10.0,45.0,'70']


# for 14 in sequence_0:
#     print('последовательность уникально')
# else:
#     print('последовательность не уникально')    

# for 10 in sequence_1:
#     print('уникально')
# else:
#     print(' не уникально')






# sequence_0 = [14,10,35,45,'60',70,90,0,105,150,10.0,45.0,'70',0]
# sequence_1 = [14,10,35,45,'60',70,90,0,105,150,'70']
# sequence_2 = [14,10,35,45,'60',70,90,0,105,150,10.0,45.0,'70',0.0]
# sequence_3 = [14,10,35,45,'60',70,90,0,105,150,10.0,45.0,'70]

# list.sort(sequence_0)
# list.sort(sequence_1)
# list.sort(sequence_2)
# list.sort(sequence_3)




 
#     Дано список 
#     nums = [137, 168, 100, 90, 60]
#     Вывести на экран сумму всех чисел из списка

nums = [137, 168, 100, 90, 60]
print sum('nums') 
