# sena = {
#     "altyn": 900,
#     "kumush": 501,
#     "bjutera": 200,
# }

# def convert(metal,som):
#     if sena.get(som) != None:
#         prosess = metal / sena[som]
#         print(som,':',prossess)
#     else:
#         print('we dont have such kind of thing')
# som = input('which kind of thing do you want exchange:' )            
# metal = float(
#     input('write GR sent: ')
# )
# convert(metal/som)



# def convert (money,valuta):
#     if cours.get(valuta)!= None:
#         result = money/cours[valuta]
#         print(valuta,':',result)
#     else:
#         print('андай валюта жок')
# valuta = input('кайсы авлютага которосуз: ')
# money = float(
#     input('сумманы айтыныз сом турундо:')
# )            
# convert(money,valuta)



# Задание 2:
    # Даны три переменные "A", "B" и "C". 
    # Изменить значения этих переменных так, чтобы в "A" хранилось значение "A"+"B", 
    # в "B" хранилась разность старых значений "C" - "A", 
    # а в "C" хранилось сумма старых значений "A" + "B" + "C". 
    # Например, A=0, B=2, C=5, тогда новые значения A=2, B=5 и C=7.

# a = 90
# b = 78
# c = 56


# u = a + b
# k = c - a
# n = a + b + c
# print(u)
# print(k)
# print(n)



#  #Задание 3:
#     # Пользователь вводит сторону квадрата. Найдите периметр и площадь квадрата.

# s = int(input('find per'))
# r = int(input('find area')) 
# print(s + s + r + r)
# print(s * r)   


# Задание 4:
    # Вам даны несколько последовательностей чисел:
    # sequence_0 = [14,10,35,45,'60',70,90,0,105,150,10.0,45.0,'70',0]
    # sequence_1 = [14,10,35,45,'60',70,90,0,105,150,'70']
    # sequence_2 = [14,10,35,45,'60',70,90,0,105,150,10.0,45.0,'70',0.0]
    # sequence_3 = [14,10,35,45,'60',70,90,0,105,150,10.0,45.0,'70']
    # Нужно проверить, все ли числа в КАЖДОЙ последовательности уникальны.
    # Если в последовательности были найдены дубликаты ---> Выведите на экран: "Последовательность не уникальна."
    # Если в последовательности дубликатов найдено не было ---> Выведите на экран: "Последовательность уникальна."
    # Если в решении задания не присутствует цикл ---> Задание не защитанint(inputо.



first ber = input( 'big num')
second ber = input('little num')
znak = '-':
znak = '+':
nak = '/':
znak = '*':
print(first num - secod number)
print(first num + secod number)
print(first num / secod number)
print(first num * secod number)






