#Problem4:
    # Пользователь вводит логин и если логин "admin", то должно выйти сообщение "Добро пожаловать, программист!”, 
    # если же логин "manager", то другая надпись - "Сайт приветствует руководство!". 
    # В другом варианте должно выйти ещё одно сообщение "Программа завершила своё исполнение..."

    # Пример:
    # Ввод: 
    # admin
    # Вывод:
    # Добро пожаловать, программист!
    # Программа завершила своё исполнение...



#Problem5:
    # a = 35
    # b = 25
    # c = 75
    # С помощью условного оператора найдите максимальное и минимальное значение из значений переменных



#Problem6:
    # Напишите программу, которая принимает число.
    #   Если число делится на 3, оно должно вывести «Fizz».
    #   Если он делится на 5, он должен вывести «Buzz».
    #   Если он делится как на 3, так и на 5, он должен вывести «FizzBuzz».
    #   В противном случае он должен вывести то же число.


#Problem7:

    # Возьмите у пользователя значения длины и ширины прямоугольника и проверьте, квадратный он или нет.


# Problem8:
    # Возьмите два значения int от пользователя и выведите наибольшее из них.
    

# Problem9:
    # a = 123
    # b = 321
    #  если сумма a и b четное -> вывести на экран половину суммы a и b
    #  если половина суммы меньше b и больше a -> вывести на экран "b > sum/2 > a"










Problem1:
     # Дан произвольный список. my_list = [1, 5, 8, 11, 55, 62, 78, 86, 91]
     # Представьте его в обратном порядке.


#Problem2:
      # Напишите программу, которая принимает список и меняет местами его первый и последний элемент. Т.е получить из old_list => new_list
      # old_list = [5, 6, 8, 99, 4, 62, 73]    => new_list = [73, 6, 8, 99, 4, 62, 5]


#Problem3:

      # Дан список [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]
      # Ваша задача:
      # - разделите список на 3, заключите третий список внутрь второго, а второй внутрь первого [1...33,[34...66, [67..100]]]

#Problem4:
      # Напишите программу, которая удаляет последний элемент из массива: lst = [9, 5, 7, 4, 2, 6, 8, 1]


#Problem5:
      # Напишите программу, которая считает количество похожих элементов, в этом случае наш элемент "5" из массива: lst = [9, 5, 7, 5, 2, 6, 5, 1, 9, 54]


#Problem6:
      # Создать пустой лист. Добавить в него сначала ваше имя, год рождения, любимый язык программирования.


#Problem7:
      # Удалить из листа [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25] все чётные индексы до 10.