 #Пользователь вводит логин и если логин "admin", то должно выйти сообщение "Добро пожаловать, программист!”, 
    # если же логин "manager", то другая надпись - "Сайт приветствует руководство!". 
    # В другом варианте должно выйти ещё одно сообщение "Программа завершила своё исполнение..."

    # Пример:
    # Ввод: 
    # admin
    # Вывод:
    # Добро пожаловать, программист!
    # Программа завершила своё исполнение...
'''log = input("your log:")

if log =='admin':
    print('welcome')
elif log =='manager':
    print('welcome director')
else:
    print('hello gest')'''
''    
